# ************************************************************
# Sequel Ace SQL dump
# 版本号： 20067
#
# https://sequel-ace.com/
# https://github.com/Sequel-Ace/Sequel-Ace
#
# 主机: 127.0.0.1 (MySQL 8.3.0)
# 数据库: travel
# 生成时间: 2024-06-15 02:04:18 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
SET NAMES utf8mb4;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE='NO_AUTO_VALUE_ON_ZERO', SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# 转储表 destination
# ------------------------------------------------------------

DROP TABLE IF EXISTS `destination`;

CREATE TABLE `destination` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `popularity` int NOT NULL,
  `category` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `rating` float NOT NULL,
  `price` float NOT NULL,
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `region` varchar(10) NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3991 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `destination` WRITE;
/*!40000 ALTER TABLE `destination` DISABLE KEYS */;

INSERT INTO `destination` (`id`, `name`, `popularity`, `category`, `rating`, `price`, `address`, `region`, `description`)
VALUES
	(1,'八达岭长城',16382,'5A景区',0.82,40,'北京市延庆县军都山关沟古道北口216省道附近','延庆','不到长城非好汉'),
	(2,'圆明园',6967,'4A景区',0.76,46,'北京市海淀区清华西路28号','海淀','追忆昔日万园之园'),
	(3,'颐和园',10820,'5A景区',0.82,39.8,'北京市海淀区新建宫门路19号','海淀','保存完整的一座皇家行宫御苑'),
	(4,'恭王府',5182,'5A景区',0.74,40,'北京市西城区什刹海前海西街17号','西城','一起去看看和珅家'),
	(5,'天坛公园',4296,'5A景区',0.8,20,'北京市东城区天坛内东里7号','东城','探寻古代皇帝祭天仪式的奥秘'),
	(6,'故宫',24711,'5A景区',1,60,'北京市东城区景山前街4号','东城','世界五大宫之首，穿越与您近在咫尺'),
	(7,'慕田峪长城',4742,'5A景区',0.7,40,'北京市怀柔区慕田峪村','怀柔','电影《非诚勿扰》取景地'),
	(10,'明十三陵',2640,'5A景区',0.72,43.7,'北京市昌平区十三陵特区','昌平','气势磅礴的陵寝建筑群'),
	(11,'北京动物园',3522,'4A景区',0.72,175,'北京市西城区西直门外大街137号','西城','百余种动物，让你离自然更近'),
	(12,'天安门广场',4353,NULL,1,27,'北京市东城区天安门','东城','我爱北京天安门，天安门上太阳升'),
	(16,'清华大学',1032,'学校',0.76,1.1,'北京市海淀区双清路30号','海淀','绿草青青，树木成荫，湖光山色，景色优雅'),
	(17,'景山公园',948,'4A景区',0.74,8,'北京市西城区景山西街44号','西城','俯看故宫绝佳位置'),
	(18,'毛主席纪念堂',1162,NULL,0.76,58,'北京市东城区天安门广场人民英雄纪念碑南面','东城','一代伟人的传世一生'),
	(19,'喇叭沟原始森林公园',738,NULL,0.7,36,'北京市怀柔区满族乡孙栅子','怀柔','浩瀚森林、险峻百丈悬崖和神秘的大峡谷'),
	(21,'北海公园',562,'4A景区',0.76,1.1,'北京市西城区文津街1号（故宫北）','西城','让我们荡起双桨，小船儿推开波浪'),
	(23,'什刹海',1006,'4A景区',0.78,10,'北京市西城区羊房胡同','西城','老北京的温柔乡，北京签到地'),
	(24,'北京天文馆',364,'3A景区',0.72,88,'北京市海淀区西直门外大街138号','海淀','陪你去看流星雨'),
	(26,'居庸关长城',426,'4A景区',0.72,37,'北京市昌平区南口镇居庸关长城','昌平','千年军事关口，地形险要，历史独特'),
	(27,'香山公园',606,'4A景区',0.72,14,'北京市海淀区买卖街40号','海淀','深秋时节，红叶漫山遍野，灿烂夺目'),
	(28,'中国国家博物馆',242,NULL,0.7,58,'北京东城区东长安街16号天安门广场东侧','东城','历史与艺术并重，凝聚中国历史文化之精华'),
	(30,'黄花城水长城',742,'3A景区',0.7,49.9,'北京市怀柔区九渡河镇西水峪','怀柔','蛟龙千寻戏碧水，探古觅幽有奇观'),
	(31,'雍和宫',250,NULL,0.76,0.5,'北京市雍和宫大街12号','东城','佛光普照，巍峨壮观雍和宫'),
	(33,'中央电视塔',1102,'4A景区',0.72,79,'北京市海淀区西三环中路11号','海淀','登高望远，俯瞰北京城'),
	(35,'北京海洋馆',1428,'4A景区',0.7,175,'北京市海淀区高粱桥斜街乙18号','西城','奇幻海洋之旅，在帝都感受大海的魅力'),
	(36,'北京欢乐谷',4813,'4A景区',0.72,39.9,'北京市朝阳区东四环小武基北路','朝阳','七大主题园区带你畅享北京欢乐谷'),
	(39,'北京自然博物馆',452,NULL,0.7,9.8,'北京市东城区（原崇文区）天桥南大街126号','东城','打开通往自然的大门，去探索大自然的奥秘'),
	(40,'天安门城楼',66,NULL,0.72,59,'北京市东城区天安门院内西侧','东城','杰出的建筑艺术和特殊的政治地位为世人瞩目'),
	(41,'中国国家大剧院',154,NULL,0.7,27,'北京市西城区西长安街2号','西城','鸟蛋！北京签到地'),
	(42,'北京大学',118,'学校',0.78,1.9,'北京市海淀区颐和园路5号','海淀','蕴含深厚人文气息，近代高等教育的奠基者'),
	(43,'北京大观园',388,'3A景区',0.76,34.9,'北京市西城区（原宣武区）南菜园街12号','西城','红楼梦中走下来的建筑'),
	(46,'北京野生动物园',6738,'4A景区',0.7,122,'北京市大兴区一零六国道','大兴','北京郊区的一座大型自然生态动物园'),
	(47,'南锣鼓巷',92,'3A景区',0.76,0.3,'北京市东城区南锣鼓巷117号','东城','也位列规划中的25片旧城保护区之中。南锣鼓巷南北走向，北起鼓楼东大街，'),
	(48,'奥林匹克公园',96,'5A景区',0.74,30,'北京市朝阳区天辰东路11号','朝阳','感受2008北京奥运的辉煌'),
	(49,'世界公园',1392,'4A景区',0.7,39.9,'北京市丰台区花乡丰葆路158号','丰台','40个国家的109处著名古迹名胜微缩景点'),
	(52,'孔庙',66,'4A景区',0.72,0.6,'北京市东城区国子监街13号','东城','北京孔庙位于安定门内国子监街，是元、明、清三代祭祀孔子的地方。孔子曾被尊为“大成至圣先师”，故又称先师庙。现在是首都博物'),
	(53,'蟒山国家森林公园',110,'3A景区',0.7,29.8,'北京市昌平区蟒山路2号','昌平','休闲度假好去处'),
	(54,'古北口长城',296,'3A景区',0.7,100,'北京市密云县古北口镇','密云','长城体系、历史古迹、人文景观、军镇文化'),
	(55,'前门大街',82,'3A景区',0.8,90,'北京市东城区（原崇文区）前门','东城','北京著名商业街'),
	(56,'十渡风景区',468,'4A景区',0.72,36,'北京市房山区十渡镇十渡村','房山','远离城市喧嚣，感受自然之美'),
	(60,'司马台长城',258,'4A景区',0.76,140,'北京市密云县东北部的古北口镇境内','密云','城墙依险峻山势而筑，以奇、特、险著称于世'),
	(123,'中山公园',6,'4A景区',0.72,0.5,'北京市东城区天安门广场中华路4号','东城','带有纪念性的坛庙园林'),
	(126,'国子监',14,'4A景区',0.74,0.6,'北京市东城区安定门内国子监街13号','东城','一所古代中央公办大学建筑'),
	(128,'八达岭野生动物园',588,'3A景区',0.7,12.9,'北京市延庆县八达岭中心停车场对面','延庆','身临“野性天地”，感受“适者生存”'),
	(130,'地坛公园',12,NULL,0.72,0.5,'北京市安定门外大街东侧','东城','悠久历史文化的皇家坛庙'),
	(132,'老舍茶馆',10,'3A景区',0.7,0.1,'北京市西城区前门西大街正阳市场三号楼老舍茶馆','西城','汇聚京剧、曲艺、杂技、变脸等特色民族艺术'),
	(133,'富国海底世界',462,'4A景区',0.7,79,'北京市朝阳区三里屯工体南路工人体育场南门','朝阳','利用高新技术让你与鱼类亲密接触'),
	(134,'首都博物馆',18,'4A景区',0.72,78,'北京市西城区复兴门外大街16号','西城','古老与现代并存，文明与科技兼顾'),
	(136,'朝阳公园',44,'4A景区',0.72,30,'北京市朝阳区农展南路1号','朝阳','在闹市中寻求一份安宁'),
	(139,'北京乔波冰雪世界',12,NULL,0.7,160,'北京市顺义区顺安路路东6号','顺义','无论风雨雷电，四季滑雪不再是梦'),
	(140,'王府井商业街',97,NULL,0.76,29.9,'北京市东城区东长安街北侧','东城','北京享有金街的美誉'),
	(145,'世界花卉大观园',270,'4A景区',0.7,35,'北京市丰台区南四环中路235号','丰台','揽天下奇花异草，聚世界经典园林'),
	(146,'烟袋斜街',4,NULL,0.72,60,'北京市西城区烟袋斜街','西城','北京同行业中的头号大烟袋了。'),
	(147,'石景山游乐园',226,'4A景区',0.7,2.3,'北京市石景山区石景山路25号','石景山','四大主题乐园，开启你的冒险之旅'),
	(152,'周口店北京猿人遗址',162,'4A景区',0.7,25,'北京市房山区周口店大街1号','房山','周口店遗址博物馆坐落在北京城西南房山区周口店龙骨山脚下，距北京市区约48公里。1921年至1927年，考古学家先后三次在'),
	(158,'北京古代建筑博物馆',30,NULL,0.7,12,'北京市东城区（原崇文区）先农坛内','东城','北京旧城模型沙盘、隆福寺藻井为馆藏珍品'),
	(160,'天门山',4,NULL,0.7,25,'北京市密云县石城镇柳棵峪','密云','观日出、看云海，赏地质奇观'),
	(165,'潭柘寺',44,'4A景区',0.7,0.4,'北京市门头沟区潭柘寺镇','门头沟','殿堂整齐，庄严宏伟'),
	(182,'玉渊潭公园',4,'4A景区',0.72,1.3,'北京市海淀区西三环中路10号','海淀','春赏樱花，冬滑冰雪，家门口的公园'),
	(183,'北京生存岛基地',28,'3A景区',0.7,105,'北京市怀柔县红螺东路6号','怀柔','群山环抱、溪流淙淙，京郊独特的度假基地'),
	(187,'八奇洞',20,NULL,0.7,48,'北京市门头沟区潭柘寺镇平原村','门头沟','冬暧夏凉，四季流水潺潺'),
	(188,'银山塔林',43,'4A景区',0.7,1,'北京市昌平区兴寿镇西湖村下庄乡湖门村零一五县道','昌平','线条优美，明清时期“燕平八景”之一'),
	(190,'青龙山',6,'4A景区',0.7,35,'北京市平谷区东高村镇','平谷','放眼望去，景色尽收眼底，让人心旷神怡'),
	(192,'北京上方山国家森林公园',40,'3A景区',0.7,27,'北京市房山区韩村河镇','房山','南有苏杭，北有上方'),
	(193,'北京艺术博物馆',65,NULL,0.7,269,'北京市海淀区 西三环北路万寿寺内','海淀','中国传统书法、绘画作为本馆主要馆藏项目'),
	(204,'古崖居',102,'3A景区',0.7,50,'北京市延庆县张山营镇镇西5公里处','延庆','赏秋好去处'),
	(206,'春晖园温泉度假村',88,NULL,0.7,59.9,'北京市顺义区高丽营镇于庄','顺义','北京高端温泉，近年价格越来越亲民'),
	(210,'戒台寺',42,'4A景区',0.7,40,'北京市门头沟区永定镇戒台寺','门头沟','到戒台寺，感受辽代佛教文化'),
	(211,'小汤山温泉度假区',12,NULL,0.7,65,'北京市昌平区小汤山现代农业科技示范园内','昌平','景色宜人，环境舒适'),
	(212,'温都水城',124,'4A景区',0.7,128,'北京市昌平区北七家镇郑各庄村王府街55号','昌平','温泉健康养生，畅享水上嘉年华'),
	(215,'百花山',6,'3A景区',0.7,3.8,'北京市门头沟区清水镇百花山林场（门头沟与房山交接处）','门头沟','秋色金黄枫独红，斜阳投射静悄悄'),
	(216,'冶仙塔',42,NULL,0.7,48,'北京市密云县檀营乡檀营村冶山','密云','密云外八景之一'),
	(218,'玉渡山',240,NULL,0.7,55,'北京市延庆县张山营镇玉皇庙村东','延庆','延庆县城西北山中的玉渡山自然风景区'),
	(219,'云居寺',64,'4A景区',0.7,35,'北京市房山区云居寺路大石窝镇水屯村口','房山','蕴涵着浓郁的佛教文化特色'),
	(224,'灵山',28,NULL,0.7,80,'北京市门头沟区清水镇西北','门头沟','凉风习习，心惬意'),
	(225,'云岫谷游猎',90,NULL,0.7,299,'北京市密云县新城子乡遥桥峪村','密云','国内的异域情调，一寨两国瑞丽江'),
	(226,'凤凰岭',28,'4A景区',0.7,21.9,'北京市海淀区苏家坨镇凤凰岭路19号','海淀','远郊的景，近郊的路，北京自然大空调'),
	(233,'鲁迅博物馆',37,NULL,0.7,39,'北京市西城区阜成门内大街宫门口内二条19号','西城','生动形象地展现了鲁迅不朽的―生'),
	(256,'金水湖景区',55,NULL,0.7,39,'北京市房山区霞云岭乡','房山','构成了“绿色观光走廊、红色旅游胜地”'),
	(261,'云龙涧',70,'3A景区',0.7,30,'北京市密云县北白岩村北','密云','几千年的深厚文化底蕴展现在世人面前'),
	(270,'白云观',4,NULL,0.74,3,'北京市西城区白云观街9号','西城','白云观内外绿树成荫，清新幽静，流连忘返'),
	(274,'古陶文明博物馆',4,NULL,0.7,25,'北京市西城区右安门内西街12号','西城','陶文化专题的博物馆，完整生动的古陶文明史'),
	(284,'老象峰',6,NULL,0.7,24.9,'北京市平谷区大华山镇小峪子村北5号','平谷','因神象巨峰而得名，森林茂密百花争艳'),
	(289,'爨底下村',10,NULL,0.7,98,'北京市门头沟区斋堂','门头沟','周围苍松翠柏，绿树成荫，悦耳的鸟鸣'),
	(290,'南宫旅游景区',38,'4A景区',0.7,29,'北京市丰台区王佐镇南宫南路1号','丰台','地热资源丰富，温泉纯正，体验绝佳'),
	(294,'白龙潭',53,'3A景区',0.7,108,'北京密云县太师屯镇龙潭沟','密云','白龙昼饮潭，修尾挂后壁'),
	(295,'北宫国家森林公园',2,'4A景区',0.7,0.5,'北京市丰台区长辛店镇大灰厂东路55号','丰台','极似南方特色，胜似画中美景。'),
	(296,'龙庆峡',12,'4A景区',0.7,2,'北京市延庆县古城村','延庆','古城九曲，带给你柳暗花明又一村的美景'),
	(298,'团结湖公园',8,'3A景区',0.7,48,'北京市朝阳区团结湖南里16号','朝阳','京城里具有江南古典园林特色的城市公园'),
	(300,'红螺湖度假区',8,NULL,0.7,17.4,'北京市怀柔区红螺镇村南','怀柔','湖水荡漾，绿树成荫，山水相依，百鸟争鸣'),
	(301,'大觉寺',2,NULL,0.7,2,'北京市海淀区西山大觉寺路9号','海淀','以清泉、古树、玉兰闻名'),
	(338,'上方云水洞',12,NULL,0.7,27,'北京市房山区韩村河镇上过山国家森林公园','房山','著名山水佛教游览胜地'),
	(345,'青龙湖公园',208,'3A景区',0.7,28.5,'北京市丰台区王佐镇青龙湖公园','丰台','放飞心情，融入青山绿水，尽享田园风光'),
	(451,'白虎涧',10,NULL,0.7,29,'北京市昌平区市阳坊镇','昌平','山峦无际，云海无边，石奇谷幽，万木峥嵘'),
	(459,'白塔寺',2,NULL,0.7,468,'北京市西城区阜成门内大街171号','西城','蓝与绿之间写就辉煌'),
	(462,'仙居谷',73,NULL,0.7,28,'密云县太师屯镇令公村北','密云','传说是仙女沐浴的地方'),
	(871,'京东石林峡',6583,'4A景区',0.7,58,'北京市平谷区黄松峪乡雕窝村73号','平谷','谷内山峰挺立峭拔，天上美景落人间'),
	(882,'中国紫檀博物馆',44,'4A景区',0.7,39,'北京市朝阳区建国路23号','朝阳','博物馆本身就是一件壮观珍贵的工艺品'),
	(883,'紫竹院公园',32,'4A景区',0.72,0.4,'北京市海淀区中关村南大街35号','海淀','以竹取胜，深富江林特色，翠竿累万'),
	(884,'观复古典艺术博物馆',98,NULL,0.7,88,'北京市朝阳区大山子张万坟金南路18号','朝阳','为公益性独立法人，接受社会各界的捐赠'),
	(886,'太平洋海底世界',270,'3A景区',0.7,78.01,'北京市海淀区西三环中路11号中央电视塔下','海淀','漫步海底，欣赏五彩缤纷的海底生物'),
	(1279,'房山世界地质公园',39,NULL,0.7,36,'北京市房山区','房山','绵延百里、蜿蜒曲折、绝壁千仞'),
	(1280,'仙栖洞',878,'3A景区',0.7,40.5,'北京市房山区张坊镇东关上村','房山','洞内恒温，支洞遍布，暗河无源'),
	(1283,'西山国家森林公园',138,NULL,0.72,9,'北京市海淀区香山南路和闵庄路交汇处向西300米','海淀','真正有山有水的森林公园'),
	(1401,'北京后花园',56,NULL,0.7,29,'北京市昌平区太行山与燕山交汇处(中关村西北侧 )','昌平','四季美景扑面而来'),
	(1403,'郁金香摩锐温泉水世界',136,NULL,0.7,59,'北京市朝阳区东苇路金盏郁金香温泉花园度假村','朝阳','北方夏威夷，豪华游乐场'),
	(1407,'响水湖',12,'3A景区',0.7,35,'北京市怀柔区响水湖长城旅游风景区','怀柔','京都养生地'),
	(1428,'京西十八潭',74,'3A景区',0.7,29.9,'北京市门头沟区王平镇安家庄','门头沟','谷深、石奇、水特、花异'),
	(1436,'灵水村',12,NULL,0.7,16,'北京市门头沟区斋堂镇灵水村','门头沟','“爸爸去哪儿”的起点'),
	(1477,'国色天香牡丹园',95,NULL,0.7,20,'北京市怀柔区京郊桥梓镇','怀柔','北京国色天香牡丹园占地2000亩。园内共栽植了中原、西北、江南、西南全国四大牡丹群九大色系的牡丹近600种1000多万株'),
	(1479,'奥林匹克水上公园',4,'4A景区',0.7,70,'北京市顺义区白马路19号','顺义','古老的东方文明与现代奥林匹克精神的结合'),
	(1480,'龙门涧',6,NULL,0.7,29,'北京市门头沟区清水镇燕家台村','门头沟','自然、质朴、健康、纯真的生活时尚'),
	(1654,'798艺术区',14,NULL,0.72,88,'北京市朝阳区东北部酒仙桥718大院内','朝阳','文化艺术资源独特，感受时尚艺术的熏陶'),
	(1657,'北京中华民族园',1694,NULL,0.72,78,'北京市朝阳区民族园路1号(健翔桥东路口)','朝阳','中华各民族文化集萃地'),
	(1659,'清凉谷风景区',560,'3A景区',0.7,30,'北京市密云县四合堂地区','密云','幽谷听溪，寻芳青岗，释放年轻的自我'),
	(1660,'八大处公园',856,'4A景区',0.72,58,'北京市石景山区八达处路3号','石景山','有八座古寺而得名，香山外另一爬山绝佳地'),
	(1662,'怀柔青龙峡',94,'4A景区',0.7,50,'北京市怀柔区怀北镇大水峪村北500米','怀柔','集青山、绿水、古长城于一体的自然风景区'),
	(1664,'金海湖风景区',842,'4A景区',0.7,31.8,'北京市平谷区东南盘山脚下海子村','平谷','峰峦叠翠，野卉生香，云影波光，美景如画'),
	(1665,'雁栖湖旅游区',874,'4A景区',0.7,29.9,'北京市怀柔区雁水路3号','怀柔','你和鱼儿都喜欢的纯净圣地'),
	(2403,'京西古道',258,NULL,0.7,25,'北京市门头沟区','门头沟','具有重要的战略和交通地位'),
	(2405,'天云山',102,NULL,0.7,73,'北京市平谷区黄松峪乡飞龙谷境内','平谷','好一个北方的张家界，神奇的天云山'),
	(2406,'银狐洞',16,NULL,0.7,60,'北京市房山区佛子庄乡下英水村','房山','银狐洞发育在5亿年前的奥陶纪与3亿2千万年前的石炭纪交汇处。多层多支，主洞、支洞横洞、竖洞、水洞、旱洞纵横交错，婉蜒曲折'),
	(2408,'北京野鸭湖国家湿地公园',686,'5A景区',0.7,24,'北京市延庆县康庄镇西北','延庆','北京市市级湿地鸟类自然保护区'),
	(2863,'云峰山',88,'3A景区',0.7,35,'北京市密云县不老屯镇燕落村','密云','密云水库，一碧万顷，烟波浩淼，无尽诗意'),
	(3212,'中国人民抗日战争纪念馆',12,'4A景区',0.7,0.6,'北京市丰台区卢沟桥宛平城内街101号','丰台','中国人民抗日战争纪念馆在北京市丰台区宛平城城内街101号。1987年7月6日“七七事变”爆发50周年前夕落成。由序厅、展'),
	(3213,'北京植物园',6,'4A景区',0.7,0.3,'北京市海淀区卧佛寺路','海淀','集科学研究、科学普及和游览功能为一体'),
	(3215,'陶然亭公园',26,'4A景区',0.72,0.5,'北京市西城区太平街19号','西城','周侯藉卉之所，右军修禊之地'),
	(3222,'红螺寺',112,'4A景区',0.7,54,'北京市怀柔区怀柔镇卢庄村北红螺东路2号','怀柔','?“寺古园林大，树古花气浓”'),
	(3223,'密云黑龙潭',36,'4A景区',0.7,59,'北京市密云县石城镇鹿皮关北','密云','黑龙潭壮美冰瀑名不虚传~'),
	(3224,'双龙峡自然风景区',158,'3A景区',0.7,72,'北京市门头沟区斋堂镇火村双龙峡景区','门头沟','水潭、绿谷、红岩组成一幅幅靓丽的美景'),
	(3962,'天安门端门',12,NULL,0.7,58,'北京天安门城楼与故宫之间','东城','明代紫禁城的正门之一，也是清代皇城的正门'),
	(3971,'圣莲山',224,'4A景区',0.7,47,'北京市房山区史家营乡柳林水村','房山','雄、险、奥、绝、秀，素有京西小五岳之美誉'),
	(3974,'京东大溶洞',234,NULL,0.7,75,'北京市平谷区黄松峪乡黑豆峪村东侧','平谷','畅游其间，神秘清幽，奇观绝景连绵不断'),
	(3983,'石花洞国家地质公园',76,'4A景区',0.7,65,'北京市房山区河北镇南车营村','房山','探索北京的地下明珠'),
	(3986,'纪晓岚故居',4,NULL,0.7,5,'北京市西城区（原宣武区）珠市口西大街241号','西城','去名人故居感受时代变迁'),
	(3989,'北京古代钱币博物馆',2,'3A景区',0.7,19,'北京市西城区北二环中路德胜门东大街9号','西城','每一次币制的变化无不影响历史的进程'),
	(3990,'京东大峡谷',86,'4A景区',0.7,72.4,'北京市平谷区山东庄镇鱼子山村','平谷','高崖形如壁立，直刺青天，峡谷狭险幽深');

/*!40000 ALTER TABLE `destination` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 travel_note
# ------------------------------------------------------------

DROP TABLE IF EXISTS `travel_note`;

CREATE TABLE `travel_note` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `destination_id` int unsigned NOT NULL,
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `views` int NOT NULL DEFAULT '0',
  `rating` float NOT NULL DEFAULT '0',
  `username` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `title` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `rate_cnt` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `fk_destination` (`destination_id`),
  CONSTRAINT `fk_destination` FOREIGN KEY (`destination_id`) REFERENCES `destination` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `travel_note` WRITE;
/*!40000 ALTER TABLE `travel_note` DISABLE KEYS */;

INSERT INTO `travel_note` (`id`, `destination_id`, `content`, `views`, `rating`, `username`, `title`, `rate_cnt`)
VALUES
	(1,6,'<p>故宫真美啊！！</p>',61,94.4709,'test','美丽',0),
	(2,6,'<p>故宫真好玩啊！！</p>',21,29.125,'test','漂亮',0),
	(3,6,'<h1>试试</h1><p><strong>富文本</strong><em>格式</em></p>',17,81.1111,'test','动人',0),
	(4,6,'<p>试试查看全文</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>试试</p>',79,60,'test','悦目',1),
	(5,6,'<p>试试看好没好</p>',1,92,'test','试试文章名称',0),
	(6,6,'<p>11111</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p>123</p>',3,94,'test','试试',0),
	(7,6,'<p>123</p>',1,96,'test','123',0),
	(8,6,'<p>好了！</p>',4,55,'test','试试好没好',0),
	(9,6,'<p>这下好了吗</p>',5,60,'test','试试好没好',0),
	(10,6,'<h1><strong>黎诗语</strong>天下第一好看！！</h1><ul><li>超好看</li><li>最好看</li></ul>',2,100,'test','黎诗语',1),
	(11,6,'<p>模拟 Ajax 异步设置内容</p>',1,80,'test','为什么还是没有',1),
	(12,6,'<p>收拾收拾</p><p><br></p>',3,80,'test','这下有了吗',1),
	(13,6,'<p>可以嘛</p>',4,75,'test','试试可以正常发送吗',0),
	(14,6,'<p>试试新版评分</p>',3,86.6667,'test','试试',3),
	(15,6,'<p><br></p>',3,0,'test','',0),
	(16,6,'<p><img src=\"http://127.0.0.1:5000/uploads/Rose.png\" alt=\"\" data-href=\"\" style=\"width: 821.00px;height: 493.56px;\"/></p><p>图片在正文才是真的屌！</p>',5,0,'test','试试图片功能',0),
	(17,6,'<p><img src=\"http://127.0.0.1:5000/uploads/images.jpeg\" alt=\"\" data-href=\"\" style=\"\"/></p><p><br></p>',4,100,'test','试试图片功能',1),
	(18,6,'<p>123</p><h1>123</h1><h2>123</h2><p><em>123</em></p>',1,0,'test','试试可以不',0),
	(19,6,'eJwBIgDd/zxwPuS8muaMieeFp+Wtl+espuS4suWtmOWCqOWQlzwvcD5+ORVB',1,0,'test','试试文本压缩功能',0),
	(20,6,'eJwVx7EKhDAMgOFXKd01VTgEqd3dHNxL0GiViKGNw739efzL93sJ/rh2U/Iy2KQqPUDTdrV7a/qPcw4e4RvXAnOiOF5C+UCOEzIuVJ9CuzXIOlhrVlSsUqbtP0W/TC8geJDwA4kxICI=',2,0,'test','试试AIGC生成',0),
	(21,6,'eJyzKbCzycxNVyguSrZVyigpKbDS1zc0MtczAEJDK1MDAwP90oKc/MSUYv2QjNR4z9yC1KLMxJz4gMScxOTUeEdPd2e9rILUdCWFxJwSWyUlhZTEkkTdjKLUNBCnuKQyJxXI0Lez0S+wAwAsryGV',2,80,'test','试试AIGC生成',1),
	(22,6,'eJyzKbCzKS4pys9Lt3s2Y/3Tycts9KFcG32gFBBl5qYrFBcl2ypllJQUWOnrGxqZ6xkAoaGVqYGBgX5pQU5+YkqxfkhGarxnbkFqUWZiTnxAYk5icqpeVkFqupJCYk6JrZKSQkpiSaJuRlFqGohTXFKZkwpk6EOsyTC0e7Kr++m6eU92dNnoA3kA6rI1og==',1,0,'123','',0),
	(23,6,'eJwtjk0OgjAUhK/SdA+vhRgTLN27c+GePKH8mAINlAVLL2BivIyJ4mlIjCuvIKCZzXyZ9zIjci5fz7NoDVaktb1WIU3ryjoploXuA/K+X8bhuqFyvA2fx0nAfCkFTH+i01LoQnLP5wImM4Pne/4PYI6NFEWZkbaJQ5pbawIA7q1dNokHK8YYdEbXmLSwz1W0LY1qCtTRDjXGyj0alVGC2oaUkgQtOnmj0hn+UylMPWapOTSL/QJDJkdN',2,0,'test','试试写游记',0),
	(24,6,'eJxVjrEOwjAMRH+lyk6dFCGkyu3ejYG9slqTFKXUSszA35MCC7rl3bvlUHrMmraH711zRPgxQvHB7c4hFED57vJPuKy+ymnqTFCVFsA159qWuPZkrYWnxI3mDNfA47AKp4XieKFIE9d3YW8qitoZU82kdAiJb3vJ+opcAD4/3q5UMWY=',1,0,'test123','试试文章',0);

/*!40000 ALTER TABLE `travel_note` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 user
# ------------------------------------------------------------

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `password` varchar(120) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `UC_username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;

INSERT INTO `user` (`id`, `username`, `password`)
VALUES
	(1,'test','123'),
	(2,'testt','123'),
	(3,'tzn','123'),
	(4,'lay','123'),
	(5,'123','123'),
	(6,'qq','123'),
	(7,'12345','123'),
	(8,'22','qw'),
	(9,'zzzzzzf','123'),
	(10,'321','123'),
	(11,'1234','123'),
	(12,'test123','123');

/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
